{"format": "graph-model", "userDefinedMetadata": {"signature": {"outputs": {"detection_boxes": {"name": "detection_boxes"}, "detection_classes": {"name": "detection_classes"}, "detection_scores": {"name": "detection_scores"}, "num_detections": {"name": "num_detections"}}}}, "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "12"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "12"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/Slice/begin"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/Slice/size"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/truediv_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/truediv_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/truediv_2_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/truediv_4_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1917"}, {"size": "4"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "Postprocessor/ExpandDims"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/Reshape_1/shape"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/Decode/transpose/perm"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "12"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "12"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"}, {"attr": {"dtype": {"type": "DT_UINT8"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "op": "Placeholder", "name": "image_tensor"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "Preprocessor/mul/x"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "add/y"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "BoxPredictor_0/Reshape_1/shape/1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/delta"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/BatchMultiClassNonMaxSuppression/strided_slice_1/stack_1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "BoxPredictor_0/Reshape_1/shape/2"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/ExpandDims_1/dim"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack_1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/Conv/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/Conv/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "16"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "24"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "144"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "384"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "576"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "160"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/expand/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/expand/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "960"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/depthwise/depthwise_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "320"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/project/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "320"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/project/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "1280"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/Conv_1/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1280"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/Conv_1/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_2_1x1_256/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_2_1x1_256/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_3_1x1_128/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_3_1x1_128/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_4_1x1_128/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_4_1x1_128/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_5_1x1_64/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_5_1x1_64/Conv2D_bn_offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128/Conv2D_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128/Conv2D_bn_offset"}, {"attr": {"frame_name": {"s": "UG9zdHByb2Nlc3Nvci9CYXRjaE11bHRpQ2xhc3NOb25NYXhTdXBwcmVzc2lvbi9tYXAvd2hpbGUvd2hpbGVfY29udGV4dA=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"], "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Enter_1"}, {"attr": {"frame_name": {"s": "UG9zdHByb2Nlc3Nvci9CYXRjaE11bHRpQ2xhc3NOb25NYXhTdXBwcmVzc2lvbi9tYXAvd2hpbGUvd2hpbGVfY29udGV4dA=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"], "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Enter"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"], "name": "Preprocessor/map/while/Enter_1"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"], "name": "Preprocessor/map/while/Enter"}, {"attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_UINT8"}}, "op": "Cast", "input": ["image_tensor"], "name": "Cast"}, {"attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "op": "Merge", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Enter_1", "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/NextIteration_1"], "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Merge_1"}, {"attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "op": "Merge", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Enter", "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/NextIteration"], "name": "Postprocessor/BatchMultiClassNonMaxSuppression/map/while/Merge"}, {"attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "op": "Merge", "input": ["Preprocessor/map/while/Enter_1", "Preprocessor/map/while/NextIteration_1"], "name": "Preprocessor/map/while/Merge_1"}, {"attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}, "op": "Merge", "input": ["Preprocessor/map/while/Enter", "Preprocessor/map/while/NextIteration"], "name": "Preprocessor/map/while/Merge"}, {"attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "op": "Shape", "input": ["Cast"], "name": "Preprocessor/map/TensorArrayUnstack/Shape"}, {"attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}, "op": "StridedSlice", "input": ["Preprocessor/map/TensorArrayUnstack/Shape", "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack", "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack_1", "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack_1"], "name": "Preprocessor/map/TensorArrayUnstack/strided_slice"}, {"attr": {"clear_after_read": {"b": true}, "element_shape": {"shape": {"unknownRank": true}}, "identical_element_shapes": {"b": true}, "tensor_array_name": {"s": ""}, "dtype": {"type": "DT_INT32"}, "dynamic_size": {"b": false}}, "op": "TensorArrayV3", "input": ["Preprocessor/map/TensorArrayUnstack/strided_slice"], "name": "Preprocessor/map/TensorArray_2"}, {"attr": {"clear_after_read": {"b": true}, "element_shape": {"shape": {"unknownRank": true}}, "identical_element_shapes": {"b": true}, "tensor_array_name": {"s": ""}, "dtype": {"type": "DT_FLOAT"}, "dynamic_size": {"b": false}}, "op": "TensorArrayV3", "input": ["Preprocessor/map/TensorArrayUnstack/strided_slice"], "name": "Preprocessor/map/TensorArray_1"}, {"attr": {"Tidx": {"type": "DT_INT32"}}, "op": "Range", "input": ["Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start", "Preprocessor/map/TensorArrayUnstack/strided_slice", "Postprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/delta"], "name": "Preprocessor/map/TensorArrayUnstack/range"}, {"attr": {"clear_after_read": {"b": true}, "element_shape": {"shape": {"unknownRank": true}}, "identical_element_shapes": {"b": true}, "tensor_array_name": {"s": ""}, "dtype": {"type": "DT_FLOAT"}, "dynamic_size": {"b": false}}, "op": "TensorArrayV3", "input": ["Preprocessor/map/TensorArrayUnstack/strided_slice"], "name": "Preprocessor/map/TensorArray"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArrayUnstack/strided_slice"], "name": "Preprocessor/map/while/Less/Enter"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArray_2"], "name": "Preprocessor/map/while/TensorArrayWrite_1/TensorArrayWriteV3/Enter"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArray_2:1"], "name": "Preprocessor/map/while/Enter_3"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArray_1"], "name": "Preprocessor/map/while/TensorArrayWrite/TensorArrayWriteV3/Enter"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArray_1:1"], "name": "Preprocessor/map/while/Enter_2"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArray"], "name": "Preprocessor/map/while/TensorArrayReadV3/Enter"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "TensorArrayScatterV3", "input": ["Preprocessor/map/TensorArray", "Preprocessor/map/TensorArrayUnstack/range", "Cast", "Preprocessor/map/TensorArray:1"], "name": "Preprocessor/map/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Less", "input": ["Preprocessor/map/while/Merge", "Preprocessor/map/while/Less/Enter"], "name": "Preprocessor/map/while/Less"}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Less", "input": ["Preprocessor/map/while/Merge_1", "Preprocessor/map/while/Less/Enter"], "name": "Preprocessor/map/while/Less_1"}, {"attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}, "op": "Merge", "input": ["Preprocessor/map/while/Enter_3", "Preprocessor/map/while/NextIteration_3"], "name": "Preprocessor/map/while/Merge_3"}, {"attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}, "op": "Merge", "input": ["Preprocessor/map/while/Enter_2", "Preprocessor/map/while/NextIteration_2"], "name": "Preprocessor/map/while/Merge_2"}, {"attr": {"frame_name": {"s": "UHJlcHJvY2Vzc29yL21hcC93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}, "op": "Enter", "input": ["Preprocessor/map/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"], "name": "Preprocessor/map/while/TensorArrayReadV3/Enter_1"}, {"op": "LogicalAnd", "input": ["Preprocessor/map/while/Less", "Preprocessor/map/while/Less_1"], "name": "Preprocessor/map/while/LogicalAnd"}, {"op": "LoopCond", "input": ["Preprocessor/map/while/LogicalAnd"], "name": "Preprocessor/map/while/LoopCond"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Switch", "input": ["Preprocessor/map/while/Merge_3", "Preprocessor/map/while/LoopCond"], "name": "Preprocessor/map/while/Switch_3"}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Switch", "input": ["Preprocessor/map/while/Merge_1", "Preprocessor/map/while/LoopCond"], "name": "Preprocessor/map/while/Switch_1"}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Switch", "input": ["Preprocessor/map/while/Merge", "Preprocessor/map/while/LoopCond"], "name": "Preprocessor/map/while/Switch"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Switch", "input": ["Preprocessor/map/while/Merge_2", "Preprocessor/map/while/LoopCond"], "name": "Preprocessor/map/while/Switch_2"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Exit", "input": ["Preprocessor/map/while/Switch_3"], "name": "Preprocessor/map/while/Exit_3"}, {"attr": {"dtype": {"type": "DT_FLOAT"}}, "op": "TensorArrayReadV3", "input": ["Preprocessor/map/while/TensorArrayReadV3/Enter", "Preprocessor/map/while/Switch_1:1", "Preprocessor/map/while/TensorArrayReadV3/Enter_1"], "name": "Preprocessor/map/while/TensorArrayReadV3"}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Identity", "input": ["Preprocessor/map/while/Switch:1"], "name": "Preprocessor/map/while/Identity"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Exit", "input": ["Preprocessor/map/while/Switch_2"], "name": "Preprocessor/map/while/Exit_2"}, {"op": "TensorArraySizeV3", "input": ["Preprocessor/map/TensorArray_2", "Preprocessor/map/while/Exit_3"], "name": "Preprocessor/map/TensorArrayStack_1/TensorArraySizeV3"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "input": ["^Preprocessor/map/while/Identity"], "name": "Preprocessor/map/while/ResizeImage/stack_1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "input": ["^Preprocessor/map/while/Identity"], "name": "Preprocessor/map/while/ResizeImage/resize/ExpandDims/dim"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "input": ["^Preprocessor/map/while/Identity"], "name": "Preprocessor/map/while/ResizeImage/stack"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": 